from flask import Flask, render_template

app = Flask(__name__)


@app.route('/')
def main():
    # Render the main page template.
    return render_template('main.html')


@app.route('/courses')
def courses():
    # Render the courses page template.
    courses = [{
        'name':
        'Інформаційні технології',
        'desc':
        'Курс для тих, хто цікавиться розробкою програмного забезпечення, створенням веб-сайтів та мобільних додатків.',
        'disciplines': [{
            'name': 'Основи програмування',
            'teacher': 'Іванов І. І.'
        }, {
            'name': 'Бази даних',
            'teacher': 'Петров П. П.'
        }, {
            'name': 'Веб-розробка',
            'teacher': 'Сидорова О. М.'
        }]
    }, {
        'name':
        'Електронні системи',
        'desc':
        'Курс для тих, хто хоче вивчити теорію та практику в галузі проектування та експлуатації електронних систем.',
        'disciplines': [{
            'name': 'Мікропроцесорна техніка',
            'teacher': 'Шевченко Т. С.'
        }, {
            'name': 'Електронні пристрої',
            'teacher': 'Ковальов А. П.'
        }, {
            'name': 'Схемотехніка',
            'teacher': 'Семенов Д. О.'
        }]
    }, {
        'name':
        'Мехатроніка',
        'desc':
        'Курс для тих, хто хоче навчитися створювати мехатронні системи, які поєднують електронні компоненти з механічними.',
        'disciplines': [{
            'name': 'Механіка',
            'teacher': 'Козлов С. В.'
        }, {
            'name': 'Електротехніка',
            'teacher': 'Шевчук О. І.'
        }, {
            'name': 'Керування мехатронними системами',
            'teacher': 'Гриньов М. В.'
        }]
    }, {
        'name':
        'Автоматика та приладобудування',
        'desc':
        'Курс для тих, хто цікавиться розробкою та застосуванням автоматичних систем керування та приладів.',
        'disciplines': [{
            'name': 'Програмування мікроконтролерів',
            'teacher': 'Козлов О. О.'
        }, {
            'name': 'Автоматичне керування',
            'teacher': 'Шевчук М. О.'
        }, {
            'name': 'Системи приладів',
            'teacher': 'Сидоренко М. В.'
        }]
    }, {
        'name':
        'Безпека інформаційних технологій',
        'desc':
        'Курс для тих, хто цікавиться захистом інформації від несанкціонованого доступу, кібератак та інших загроз.',
        'disciplines': [{
            'name': 'Криптографія',
            'teacher': 'Семенов С. В.'
        }, {
            'name': 'Безпека мереж',
            'teacher': 'Ковальова І. І.'
        }, {
            'name': 'Антивірусна захист',
            'teacher': 'Богданов М. В.'
        }]
    }, {
        'name':
        'Електроенергетика',
        'desc':
        'Курс для тих, хто цікавиться виробництвом, передачею та розподілом електроенергії.',
        'disciplines': [{
            'name': 'Промислова електроніка',
            'teacher': 'Савченко С. В.'
        }, {
            'name': 'Енергетичні системи',
            'teacher': 'Гаврилюк О. І.'
        }, {
            'name': 'Енергетична ефективність',
            'teacher': 'Корнієнко М. В.'
        }]
    }]

    return render_template('courses.html', courses=courses)


@app.route('/costs')
def costs():
    # Render the costs page template.
    costs = [{
        'name': 'Інформаційні технології',
        'cost': '15 000 грн'
    }, {
        'name': 'Електронні системи',
        'cost': '12 000 грн'
    }, {
        'name': 'Мехатроніка',
        'cost': '14 000 грн'
    }, {
        'name': 'Автоматика та приладобудування',
        'cost': '11 000 грн'
    }, {
        'name': 'Безпека інформаційних технологій',
        'cost': '18 000 грн'
    }, {
        'name': 'Електроенергетика',
        'cost': '13 000 грн'
    }]
    return render_template('costs.html', costs=costs)


@app.route('/contact')
def contact():
    # Render the contact page template.
    return render_template('contact.html')


if __name__ == '__main__':
    app.run(debug=True)
